let a = 100
// console.log(global.a); global中没有a
// ************************************************* 一个文件就是一个模块。每个模块都有自己的作用域 ****************************************************
// 我们使用var来申明的变量，他并不是全局的，而是属于当前模块下
console.log(a); // => 100
// r如果想声明全局的
global.a = 200 // => 这个里面的a和上面的a不是一个变量

console.log(a);  // => ,因为取的当前模块下的,依旧是100

console.log(global.a);  // => 此时是取得全局的a200
console.log(__filename);  // =>当前文件被解析过后的绝对路径 /Users/liumanman/nj6ceng/datum/lmm_nodeJs/ECMAScript/模块的使用/1.js

// 模块加载系统
// ************************************************* 如果是javascript:是通过script标签来使用 *************************************************
// ************************************************* 如果是node是通过require来引入 *************************************************

// require('模块')
// 如何调用2.js中的方法
let moduleTwo = require('./2') // ====> 打印出2.js中的值
console.log(moduleTwo.moduleFn());
// ************************************************* 模块名自动补齐后缀优先级：文件名 > .js > .json > .node *************************************************，
// console.log(moduleTwo)
